---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarContainerItem.LayoutRule
source: html/3bf12e22-a943-c022-51ac-4cd62099dc94.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.LayoutRule Property

Identifies the layout rule of rebar set.

## Syntax (C#)
```csharp
public RebarLayoutRule LayoutRule { get; }
```